<script>
	import colors from "$lib/js/colors";
	import { show_toast } from "@/lib/js/common.js";

	export let category;
</script>

<div class="mx-5 flex flex-col">
	<div class="mt-11 text-xl font-semibold">
		<p>어떤 방법으로</p>
		<p>조사를 진행할까요?</p>
	</div>

	<button
		on:click={() => {
			category = category === "research" ? "" : "research";
		}}
		class={`mt-10 flex h-20 items-center rounded-lg bg-${category === "research" ? "primary" : "gray-50"}  pl-6`}
	>
		<svg
			class="mr-5"
			width="22"
			height="27"
			viewBox="0 0 22 27"
			fill="none"
			xmlns="http://www.w3.org/2000/svg"
		>
			<path
				fill-rule="evenodd"
				clip-rule="evenodd"
				d="M11.3492 0V7.45039L11.3492 7.5048C11.3492 7.92887 11.3491 8.34099 11.3948 8.68091C11.4463 9.06411 11.5718 9.50139 11.935 9.8646C12.2982 10.2278 12.7355 10.3533 13.1187 10.4049C13.4586 10.4506 13.8707 10.4505 14.2948 10.4504H14.2948H14.2948H14.2948L14.3492 10.4504H21.7992V18.9C21.7992 22.7184 21.7992 24.6276 20.613 25.8138C19.4268 27 17.5176 27 13.6992 27H8.29922C4.48084 27 2.57165 27 1.38544 25.8138C0.199219 24.6276 0.199219 22.7184 0.199219 18.9V8.1C0.199219 4.28162 0.199219 2.37244 1.38544 1.18622C2.57165 0 4.48084 0 8.29922 0H11.3492ZM13.3492 0.00113874V7.45039C13.3492 7.95006 13.3514 8.22422 13.3769 8.41441L13.3779 8.4217L13.3852 8.4227C13.5754 8.44827 13.8496 8.45039 14.3492 8.45039H21.7981C21.7928 7.68974 21.7629 7.24359 21.5937 6.83513C21.3882 6.33895 20.998 5.94877 20.2176 5.1684L20.2176 5.16838L16.6308 1.58162C15.8505 0.801241 15.4603 0.411051 14.9641 0.205525C14.5557 0.0363679 14.1096 0.00643535 13.3492 0.00113874ZM5.94922 14.8496C5.94922 14.2973 6.39693 13.8496 6.94922 13.8496L15.0492 13.8496C15.6015 13.8496 16.0492 14.2973 16.0492 14.8496C16.0492 15.4019 15.6015 15.8496 15.0492 15.8496L6.94922 15.8496C6.39693 15.8496 5.94922 15.4019 5.94922 14.8496ZM6.94922 19.25C6.39693 19.25 5.94922 19.6977 5.94922 20.25C5.94922 20.8023 6.39693 21.25 6.94922 21.25H12.3492C12.9015 21.25 13.3492 20.8023 13.3492 20.25C13.3492 19.6977 12.9015 19.25 12.3492 19.25H6.94922Z"
				fill={category === "research" ? "white" : colors.gray[900]}
			/>
		</svg>
		<div
			class={`flex flex-grow flex-col items-start gap-2 text-${category === "research" ? "white" : "gray-900"}`}
		>
			<p class="font-semibold">설문조사</p>
			<p class="text-xs">이미 만들어둔 설문 폼으로 설문조사를 진행해보세요</p>
		</div>
	</button>

	<button
		class="mt-4 flex h-20 items-center rounded-lg bg-gray-50 pl-6"
		on:click={() => {
			show_toast("info", "준비중입니다.");
		}}
	>
		<svg
			class="mr-5"
			width="18"
			height="28"
			viewBox="0 0 18 28"
			fill="none"
			xmlns="http://www.w3.org/2000/svg"
		>
			<path
				d="M8.52637 27.0005V22.7373"
				stroke="#797E8A"
				stroke-width="2"
				stroke-linecap="round"
				stroke-linejoin="round"
			/>
			<path
				fill-rule="evenodd"
				clip-rule="evenodd"
				d="M0.0580219 7.52632H4.26316C4.81544 7.52632 5.26316 7.97403 5.26316 8.52632C5.26316 9.0786 4.81544 9.52632 4.26316 9.52632H0V13.2105H4.26316C4.81544 13.2105 5.26316 13.6582 5.26316 14.2105C5.26316 14.7628 4.81544 15.2105 4.26316 15.2105H0.0580211C0.553089 19.4483 4.15566 22.7368 8.52632 22.7368C12.897 22.7368 16.4995 19.4483 16.9946 15.2105H14.2105C13.6582 15.2105 13.2105 14.7628 13.2105 14.2105C13.2105 13.6582 13.6582 13.2105 14.2105 13.2105H17.0526V9.52632H14.2105C13.6582 9.52632 13.2105 9.0786 13.2105 8.52632C13.2105 7.97403 13.6582 7.52632 14.2105 7.52632H16.9946C16.4995 3.28858 12.897 0 8.52632 0C4.15566 0 0.553093 3.28858 0.0580219 7.52632Z"
				fill="#797E8A"
			/>
		</svg>
		<div class="flex flex-grow flex-col items-start gap-2 text-gray-900">
			<p class="font-semibold">인터뷰</p>
			<p class="text-xs">인터뷰를 통해 세분화된 데이터를 수집해보세요</p>
		</div>
	</button>
</div>
